// การคืนค่าหลายค่า
// ฟังก์ชันสามารถคืนค่าได้หลายค่าด้วยการคืนออกมาเป็น tuple

// สามารถอ้างถึงสมาชิกของ Tuple ได้ด้วย index

// Rust รองรับการถอดโครงสร้างได้หลายแบบ ซึ่งเราจะได้เห็นว่าทำได้อีกหลายวิธี โดยจะทำให้เราแยกของที่อยู่ในโครงสร้างออกมาเป็นชิ้นย่อยๆ ตามหลักสรีรศาสตร์ จับตาดูไว้ให้ดี!

fn swap(x: i32, y: i32) -> (i32, i32) {
    return (y , x);
}

fn main() {
    let result = swap(123, 321);
    println!("{} {}", result.0, result.1);

    let (a, b) = swap(result.0,  result.1);
    println!("{} {}", a, b);
}
