// for
// for ของ Rust พัฒนาไปอีกขั้นด้วยการที่ มันสามารถ วนลูปซ้ำๆให้กับนิพจน์ใดก็ตามที่ถูกประเมินว่าเป็น iterator แล้ว iterator คืออะไรน่ะเหรอ? เจ้า iterator มันก็คือ ออปเจ็ค ที่คุณสามารถถามมันว่า "คุณมีของอะไรอีกบ้าง?" ไปจนกว่ามันจะไม่มีอะไรให้คุณอีก

// เราค่อยมาสำรวจเรื่องนี้กันต่อภายหลัง ตอนนี้รู้ไว้เพียงแค่ Rust สร้าง iterator จากลำดับของตัวเลขได้ง่ายมากๆ

// operator .. สร้าง iterator จากตัวเลขเริ่มต้นทางซ้ายไปเรื่อยๆจนถึง แต่ไม่รวมค่าทางด้านขวา

// operator ..= สร้าง iterator จากตัวเลขเริ่มต้นทางซ้ายไปเรื่อยๆจนถึง และรวมค่าทางด้านขวา

fn main() {
    for x in 0..5 {
        print!("{} ,", x);
    }
    println!();
    for x in 0..=5 {
        print!("{}, ", x);
    }
}
