// การเปลี่ยนเจ้าของ
// มื่อเจ้าของถูกส่งผ่านเป็นอาร์กิวเมนต์ไปยังฟังก์ชันความเป็นเจ้าของจะถูกย้ายไปที่พารามิเตอร์ฟังก์ชัน

// หลังจาก ย้าย ไปแล้ว ตัวแปรในฟังก์ชันเดิมจะไม่สามารถใช้งานได้อีกต่อไป

// รายละเอียดหน่วยความจำ:

// ในระหว่างการ ย้าย หน่วยความจำ stack ของค่าเจ้าของจะถูกคัดลอกไปยังหน่วยความจำ stack พารามิเตอร์ของการเรียกฟังก์ชัน

struct Foo {
    x: i32,
}

fn do_something(f: Foo) {
    println!("{}", f.x);
    // f is dropped here
}

fn main() {
    let foo = Foo { x: 42 };
    // foo is moved to do_something
    do_something(foo);
    // foo can no longer be used
}

