// การเปลี่ยนแปลงค่าในตัวแปร
// Rust ให้ความใส่ใจเป็นอย่างยิ่งในเรื่องการแก้ไขค่าในตัวแปร จึงแบ่งประเภทการประกาศเป็นสองแบบ:

// mutable - แบบเปลี่ยนแปลงค่าได้ แบบนี้คอมไพเลอร์จะอนุญาตให้เขียนและอ่านค่าในตัวแปรได้
// immutable - แบบเปลี่ยนแปลงค่าไม่ได้ แบบนี้คอมไพเลอร์จะอนุญาตให้อ่านค่าในตัวแปรได้เท่านั้น
// ตัวแปรที่เปลี่ยนค่าได้ จะมีคีเวิร์ด mut

// เราจะคุยเรื่องนี้กันอีกในภายหลัง แต่ตอนนี้แค่จับตาดูมันไว้ก่อนก็พอ

fn main() {
    let mut x = 42;
    println!("{}", x);
    x = 13;
    println!("{}", x);

    // cannot assign twice to immutable variable
    // let z = 32;
    // println!("{}", z);
    // z = 56;
    // println!("{}", z);
}
