// การประกาศ String
// String เป็น Unicode เสมอ

// type ของ String ประกาศโดยใช้ &'static str:

// & หมายความว่านี่คือการอ้างถึงพื้นที่หนึ่งในหน่วยความจำ และมันไม่ใช่ &mut นั่นแปลว่าคอมไพเลอร์จะไม่ยอมให้แก้ไขข้อความนี้ได้
// 'static แปลว่า ข้อความสตริงนี้จะคงอยู่ไปจนกว่าโปรแกรมจะสิ้นสุด(มันจะไม่โดน drop แน่นอน)
// str แปลว่า มันชี้ไปที่สายลำดับของไบต์ที่เป็น utf-8 ที่ถูกต้องแน่นอน
// รายละเอียดหน่วยความจำ:

// คอมไพเลอร์ของ Rust มีแนวโน้มที่จะวางสตริงของคุณไว้ใน หน่วยความจำของโปรแกรมส่วนที่เป็น data segment

fn main() {
    let a: &'static str = "hi 🦀";
    println!("{} {}", a, a.len());
}

